<?php

/**
 * 状态码message
 */

return [
        
        //通用
        '1' => '成功',
        '0' => '服务器错误',
        /*
         * 前台部分
         */
        '0000' => '入参错误',
        
        '1000' => '登陆已过期,请重新登录',
        '1001' => '请先登录',
        '1002' => '必要参数:\'accessToken\'错误',
        '1003' => '当前账号在另一台手机登录,请重新登录',
        '1004' => '当前账号登录已过期,请重新登录',
        '1005' => '获取用户信息失败',
        '1006' => '缺少令牌',
        '1007' => '令牌错误',
        '1008' => '令牌已失效',
        '1009' => '助记词错误',
        '1010' => '账号注册失败',
        '1011' => '助记词验证错误',
        '1012' => '密保问题错误',
        '1013' => '原密码错误',
        '1014' => '请先打开消息推送',
        '1015' => '支付密码已经设置过了',
        '1015' => '支付密码已经设置过了',
        '1016' => '支付方式不存在',
        '1017' => '订单创建失败',
        '1018' => '订单支付失败',
        '1019' => '未设置支付密码',
        '1020' => '支付密码错误',
        '1021' => '订单不存在',
        '1022' => '余额不足',
        '1023' => '订单取消失败',
        '1024' => '验证码错误',
        '1025' => '昵称重复',
        '1026' => '此币种不支持提现',
        '1027' => '钱包余额不足',
        '1028' => '钱包余额不够支付手续费',
        '1029' => '商品已下架',
        '1030' => '手势密码错误',
        '1031' => '该地区无货',
        '1032' => '库存不足',
        '1033' => '支付方式不存在',
        '1034' => '原手势密码错误',
        '1035' => '服务单创建失败',
        '1036' => '邀请码无效',
        '1037' => '订单最低消费15USDT',
        '1038' => '红包未达到提现要求,无法开启红包',
        '1039' => '请先提现上一次红包',
        '1041' => '无法开启下一次红包',
        '1042' => '未满足领取条件',
        '1043' => '手续费资金池余额不足',
        '1044' => '转入手续费失败',
        '1045' => '当前信息无法修改',
        '1046' => '上架中无法修改',
        '1047' => '未支付审核费无法修改',
        '1048' => '信息修改失败',
        '1049' => '待支付审核金的信息不存在',
        '1050' => '物品不存在',
        '1051' => '不能购买自己发布的',
        '1052' => '非法购买',
        '1053' => '非法购买,无法发起支付',
        '1054' => '账号或密码错误',
        '1055' => '登录失败',
        '1056' => '当前交易无法再发起纠纷',
        '1057' => '此纠纷已过举证期,无法提交',
        '1058' => '卖家不存在',
        //地址
        '1040' => '收货地址信息不存在',

        /**
         * 后台部分
         */
        '9000' => '请输入正确验证码',
        '9001' => '后台用户不存在',
        '9002' => '该账户已被冻结',
        '9003' => '登录密码不正确',
        '9004' => '权限不足',
        '9005' => '验证码错误',
        '9006' => '需重新登录',
        
        //后台商品部分
        '9101' => '此分类下含有子分类无法删除',
        '9102' => '此分类下含有商品无法删除',
        '9103' => '第三级分类下无法创建',



];
